Revit 2027 API
BuiltInFailures.GeneralFailures.InvalidInput Property
 Invalid Input
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidInput { get; }
Public Shared ReadOnly Property InvalidInput As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidInput {
	FailureDefinitionId^ get ();
}
static member InvalidInput : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace